rhrc/app/Models/ParticipantsModel.php

    public function get_participants_list($tablename,$param){


        $query = $this->db->table('tblparticipants a');
            $query->select('a.*, b.sectorname, c.regDesc,d.provDesc');
            $query->join('tblsector b', 'b.sectorid = a.sector');
            $query->join('refregion c', 'c.regCode = a.address_region');
            $query->join('refprovince d', 'd.provCode = a.address_province');

            if ($param['event'] != 'all' && $param['event'] != '') {
                $query->where($param);
            }
            $query->groupBy('a.regnumber');
            $query->orderBy('a.participantid', 'DESC');

        return $query->get()->getResultArray();
---
SELECT *
FROM `tblparticipants`
JOIN `tblsector` ON `tblsector`.`sectorid` = `tblparticipants`.`sector`
JOIN `refregion` ON `refregion`.`regCode` = `tblparticipants`.`address_region`
JOIN `refprovince` ON `refprovince`.`provCode` = `tblparticipants`.`address_province`
ORDER BY `tblparticipants`.`regnumber` DESC