rstw2023/app/Models/AttendanceModel.php

    public function search_participant($tablename,$param){

        $builder = $this->db->table($tablename);
        $builder->select('*');
        $builder->join('tblsector', 'tblsector.sectorid = tblparticipants.sector');
        $builder->join('refregion', 'refregion.regCode = tblparticipants.address_region');
        $builder->join('refprovince', 'refprovince.provCode = tblparticipants.address_province');
        $builder->join('tblevents', 'tblevents.shorthand = tblparticipants.event');
        $builder->like('lastname',$param['lastname'],'both');
        $builder->like('firstname',$param['firstname'],'both');
        $builder->orderBy('tblparticipants.participantid','DESC');

        $query   = $builder->get();
---
SELECT *
FROM `tblparticipants`
JOIN `tblevents` ON `tblevents`.`shorthand` = `tblparticipants`.`event`
WHERE `lastname` LIKE '%DOE%' ESCAPE '!'
AND  `firstname` LIKE '%%' ESCAPE '!'
ORDER BY `tblparticipants`.`participantid` DESC

    public function get_available_events($param){
        $lastname = $param['lastname'];
        $firstname = $param['firstname'];

        $builder = $this->db->table('tblevents a');
        $builder->select('*');
        $builder->where('a.is_closed !=', 1);
        $builder->whereNotIn('a.shorthand', function($subquery)  use ($lastname, $firstname){

            $subquery->select('b.event')->from('tblparticipants b')
                    ->like('b.lastname',$lastname,'both')
                    ->like('b.firstname',$firstname,'both');
        }
    );
        return $builder->get()->getResultArray();
---
SELECT *
FROM `tblevents` `a`
WHERE `a`.`is_closed` != 1
AND `a`.`shorthand` NOT IN (SELECT `b`.`event` FROM `tblparticipants` `b` WHERE `b`.`lastname` LIKE '%DOE%' ESCAPE '!' AND  `b`.`firstname` LIKE '%%' ESCAPE '!')