rstw2023/app/Models/CertificateModel.php

    public function get_single_data($tablename,$param){

        $builder = $this->db->table('tblevaluation a');
        $builder->select("a.certnumber, a.certnumber_hashed, a.event, a.fullname, a.email, a.agency_name, b.name as eventname, b.datetime");
        $builder->join('tblevents b','b.shorthand = a.event');
        $builder->where($param);
        $query   = $builder->get();
---
SELECT `a`.`certnumber`, `a`.`certnumber_hashed`, `a`.`event`, `a`.`fullname`, `a`.`email`, `a`.`agency_name`, `b`.`name` as `eventname`, `b`.`datetime`
FROM `tblevaluation` `a`
JOIN `tblevents` `b` ON `b`.`shorthand` = `a`.`event`
WHERE `certnumber_hashed` = '55079eb072dc0de61f1e7e57b6dd04d6'