handa/app/Models/AttendanceModel.php

SELECT *
FROM `tblevents`
---
    public function get_data($tablename,$param){

        $builder = $this->db->table($tablename);
        $builder->select('*');
        $builder->join('tblsector', 'tblsector.sectorid = tblparticipants.sector');
        $builder->join('refregion', 'refregion.regCode = tblparticipants.address_region');
        $builder->join('refprovince', 'refprovince.provCode = tblparticipants.address_province');
        $builder->join('tblevents', 'tblevents.shorthand = tblparticipants.event');
        $builder->where($param);
        $query   = $builder->get();

SELECT *
FROM `tblattendance`
JOIN `tblparticipants` ON `tblparticipants`.`regnumber` = `tblattendance`.`regnumber`
JOIN `tblsector` ON `tblsector`.`sectorid` = `tblparticipants`.`sector`
JOIN `refregion` ON `refregion`.`regCode` = `tblparticipants`.`address_region`
JOIN `refprovince` ON `refprovince`.`provCode` = `tblparticipants`.`address_province`
JOIN `tblevents` ON `tblevents`.`shorthand` = `tblattendance`.`event`
ORDER BY `tblattendance`.`regnumber` DESC
---
    public function get_attendance_list($tablename,$param){

        $builder = $this->db->table($tablename);
        $builder->select('*');
        $builder->join('tblparticipants', 'tblparticipants.regnumber = tblattendance.regnumber');
        $builder->join('tblsector', 'tblsector.sectorid = tblparticipants.sector');
        $builder->join('refregion', 'refregion.regCode = tblparticipants.address_region');
        $builder->join('refprovince', 'refprovince.provCode = tblparticipants.address_province');
        $builder->join('tblevents', 'tblevents.shorthand = tblattendance.event');

        if ($param['event'] != 'all' && $param['event'] != '') {
            $builder->where('tblattendance.event',$param['event']);
        }
        $query = $builder->orderBy('tblattendance.regnumber','DESC');
        $query = $builder->get();

SELECT *
FROM `tblparticipants`
JOIN `tblsector` ON `tblsector`.`sectorid` = `tblparticipants`.`sector`
JOIN `refregion` ON `refregion`.`regCode` = `tblparticipants`.`address_region`
JOIN `refprovince` ON `refprovince`.`provCode` = `tblparticipants`.`address_province`
JOIN `tblevents` ON `tblevents`.`shorthand` = `tblparticipants`.`event`
ORDER BY `tblparticipants`.`regnumber` DESC
 LIMIT 5
---
    public function get_attendance_list_recent_5($tablename){


        $builder = $this->db->table($tablename);
        $builder->select('tblparticipants.*,tblattendance.date_registered AS date_registered,tblevents.shorthand,refregion.regDesc,refprovince.provDesc,tblsector.sectorname,tblevents.name');
        $builder->join('tblparticipants', 'tblparticipants.regnumber = tblattendance.regnumber');
        $builder->join('tblsector', 'tblsector.sectorid = tblparticipants.sector');
        $builder->join('refregion', 'refregion.regCode = tblparticipants.address_region');
        $builder->join('refprovince', 'refprovince.provCode = tblparticipants.address_province');
        $builder->join('tblevents', 'tblevents.shorthand = tblparticipants.event');
        $query = $builder->orderBy('tblattendance.date_registered','DESC');
        $query = $builder->limit(5);
        $query = $builder->get();

SELECT *
FROM `tblparticipants`
JOIN `tblsector` ON `tblsector`.`sectorid` = `tblparticipants`.`sector`
JOIN `refregion` ON `refregion`.`regCode` = `tblparticipants`.`address_region`
JOIN `refprovince` ON `refprovince`.`provCode` = `tblparticipants`.`address_province`
JOIN `tblevents` ON `tblevents`.`shorthand` = `tblparticipants`.`event`
WHERE `lastname` LIKE '%khu%' ESCAPE '!'
AND  `firstname` LIKE '%%' ESCAPE '!'
---
    public function search_participant($tablename,$param){

        $builder = $this->db->table($tablename);
        $builder->select('*');
        $builder->join('tblsector', 'tblsector.sectorid = tblparticipants.sector');
        $builder->join('refregion', 'refregion.regCode = tblparticipants.address_region');
        $builder->join('refprovince', 'refprovince.provCode = tblparticipants.address_province');
        $builder->join('tblevents', 'tblevents.shorthand = tblparticipants.event');
        $builder->like('lastname',$param['lastname'],'both');
        $builder->like('firstname',$param['firstname'],'both');
        $builder->orderBy('tblparticipants.participantid','DESC');

        $query   = $builder->get();