handa/app/Models/DashboardModel.php

SELECT `b`.`name`, COUNT(a.evaluationid) AS noofrespondents, ROUND(AVG(IFNULL(a.responsiveness, 0)), 1) AS responsiveness, ROUND(AVG(IFNULL(a.reliability, 0)), 1) AS reliability, ROUND(AVG(IFNULL(a.access_and_facilities, 0)), 1) AS access_and_facilities, ROUND(AVG(IFNULL(a.communication, 0)), 1) AS communication, ROUND(AVG(IFNULL(a.cash, 0)), 1) AS cash, ROUND(AVG(IFNULL(a.integrity, 0)), 1) AS integrity, ROUND(AVG(IFNULL(a.assurance, 0)), 1) AS assurance, ROUND(AVG(IFNULL(a.outcome, 0)), 1) AS outcome, ROUND(AVG(IFNULL(a.overall_satisfaction, 0)), 1) AS overall_satisfaction
FROM `tblevaluation` `a`
JOIN `tblevents` `b` ON `b`.`shorthand` = `a`.`event`
GROUP BY `b`.`shorthand`
ORDER BY `b`.`eventid`
---
    public function get_eval_data(){

        $builder = $this->db->table('tblevaluation a');
        $builder->select('b.name');
        $builder->select('COUNT(a.evaluationid) AS noofrespondents');
        $builder->select('ROUND(AVG(IFNULL(a.responsiveness, 0)), 1) AS responsiveness', false);
        $builder->select('ROUND(AVG(IFNULL(a.reliability, 0)), 1) AS reliability', false);
        $builder->select('ROUND(AVG(IFNULL(a.access_and_facilities, 0)), 1) AS access_and_facilities', false);
        $builder->select('ROUND(AVG(IFNULL(a.communication, 0)), 1) AS communication', false);
        $builder->select('ROUND(AVG(IFNULL(a.cash, 0)), 1) AS cash', false);
        $builder->select('ROUND(AVG(IFNULL(a.integrity, 0)), 1) AS integrity', false);
        $builder->select('ROUND(AVG(IFNULL(a.assurance, 0)), 1) AS assurance', false);
        $builder->select('ROUND(AVG(IFNULL(a.outcome, 0)), 1) AS outcome', false);
        $builder->select('ROUND(AVG(IFNULL(a.overall_satisfaction, 0)), 1) AS overall_satisfaction', false);
        $builder->join('tblevents b', 'b.shorthand = a.event');
        $builder->groupBy('b.shorthand');
        $builder->orderBy('b.eventid');

        return $builder->get()->getResultArray();