handa/app/Models/EvaluationModel.php

SELECT *
FROM `tblevaluation`
JOIN `tblevents` ON `tblevents`.`shorthand` = `tblevaluation`.`event`
JOIN `refregion` ON `refregion`.`regCode` = `tblevaluation`.`address_region`
JOIN `refprovince` ON `refprovince`.`provCode` = `tblevaluation`.`address_province`
WHERE `event` = 'pagsubay'
ORDER BY `tblevaluation`.`evaluationid` DESC
---
    public function get_participants_list($tablename, $param){
        $builder = $this->db->table($tablename);
        $builder->select('*');
        $builder->join('tblevents', 'tblevents.shorthand = tblevaluation.event');
        $builder->join('refregion', 'refregion.regCode = tblevaluation.address_region');
        $builder->join('refprovince', 'refprovince.provCode = tblevaluation.address_province');

        if ($param['event'] != 'all' && $param['event'] != '') {
            $builder->where($param);
        }
        $query = $builder->orderBy('tblevaluation.evaluationid','DESC');
        $query = $builder->get();