handa/app/Models/FoodModel.php

    public function get_redeemed_list($tablename,$param){
        $builder = $this->db->table($tablename);
        $builder->select('*');
        $builder->join('tblparticipants', 'tblparticipants.regnumber = tblfoodredeem.regnumber');

        if ($param['type'] != 'all' && $param['type'] != '') {
            $builder->where('tblfoodredeem.type',$param['type']);
        }
        $query   = $builder->get();
---
SELECT *
FROM `tblfoodredeem`
JOIN `tblparticipants` ON `tblparticipants`.`regnumber` = `tblfoodredeem`.`regnumber`