handa/app/Models/ParticipantsModel.php

SELECT *
FROM `tblparticipants`
JOIN `tblsector` ON `tblsector`.`sectorid` = `tblparticipants`.`sector`
JOIN `refregion` ON `refregion`.`regCode` = `tblparticipants`.`address_region`
JOIN `refprovince` ON `refprovince`.`provCode` = `tblparticipants`.`address_province`
JOIN `tblevents` ON `tblevents`.`shorthand` = `tblparticipants`.`event`
ORDER BY `tblparticipants`.`regnumber` DESC
---
    public function get_participants_list($tablename,$param){


        $builder = $this->db->table($tablename);
        $builder->select('*');
        $builder->join('tblsector', 'tblsector.sectorid = tblparticipants.sector');
        $builder->join('refregion', 'refregion.regCode = tblparticipants.address_region');
        $builder->join('refprovince', 'refprovince.provCode = tblparticipants.address_province');
        $builder->join('tblevents', 'tblevents.shorthand = tblparticipants.event');

        if ($param['event'] != 'all' && $param['event'] != '') {
            $builder->where($param);
        }
        $query = $builder->orderBy('tblparticipants.regnumber','DESC');
        $query = $builder->get();